// целые числа 
let digit = 25;

// дробные числа
let fract = 25.03;

// экспоненциальная запись 2*10 в десятой степени
let exp = 2e10; // 20000000000 (десять нулей)
let expSmall = 2e-3; // 0.002 
let expFract = 1.25e3; // 1250
let expFractSmall = 1.25e-3; // 0.00125

//так же корректная запись чисел
let fract1 = 25.; //целые числа
let fract2 = .25; //ноль целых двадцать пять сотых

//десятичные и двоичные 
// 0, 1, 2,  3,  4,   5,   6,   7,   8,    9
// 0, 1, 10, 11, 100, 101, 110, 111, 1000, 1001

//десятичная
let dec = 9;

//двоичная
let bin = 0b1001

//восьмиричная 
let oct = 0o10; // число 8

//шестнадцатиричная
let x = 0x1b; // число 27

// Бывает неточность вычислений с плавоющей точкой  с дробными числами.
